[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/Coke.cs:26:5
     /// <param name="cContent"></param>
     /// <param name="proportion"></param>
     public Coke(Percentual cContent, Percentual proportion)
-    {
-        CContent = cContent;
-        Proportion = proportion;
-    }
+    {}
 
     /// <summary>
