[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:84:5
     /// <param name="coke"></param>
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(Coke coke)
-    {
-        if (TotalProportion.Value + coke.Proportion.Value > 100)
-        {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
-        }
-
-        TotalProportion.Value += coke.Proportion.Value;
-        cokes.Add(coke);
-    }
+    {}
 
     /// <summary>

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:90:9
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
         }
 
-        TotalProportion.Value += coke.Proportion.Value;
+        TotalProportion.Value -= coke.Proportion.Value;
         cokes.Add(coke);
     }

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:91:9
         }
 
         TotalProportion.Value += coke.Proportion.Value;
-        cokes.Add(coke);
+        ;
     }
 

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:98:5
     /// Normalize proportions of Cokes to 100%
     /// </summary>
     public void NormalizeProportions()
-    {
-        var tempTotalProportion = 0d;
-
-        foreach (var coke in cokes)
-        {
-            coke.Proportion.Value = coke.Proportion.Value / TotalProportion.Value * 100;
-            tempTotalProportion += coke.Proportion.Value;
-        }
-
-        TotalProportion.Value = tempTotalProportion;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:102:9
         var tempTotalProportion = 0d;
 
         foreach (var coke in cokes)
-        {
-            coke.Proportion.Value = coke.Proportion.Value / TotalProportion.Value * 100;
-            tempTotalProportion += coke.Proportion.Value;
-        }
+        {}
 
         TotalProportion.Value = tempTotalProportion;

[Killed] Arithmetic mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:103:37
 
         foreach (var coke in cokes)
         {
-            coke.Proportion.Value = coke.Proportion.Value / TotalProportion.Value * 100;
+            coke.Proportion.Value = coke.Proportion.Value / TotalProportion.Value / 100;
             tempTotalProportion += coke.Proportion.Value;
         }

[Killed] Arithmetic mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:103:37
 
         foreach (var coke in cokes)
         {
-            coke.Proportion.Value = coke.Proportion.Value / TotalProportion.Value * 100;
+            coke.Proportion.Value = coke.Proportion.Value * TotalProportion.Value * 100;
             tempTotalProportion += coke.Proportion.Value;
         }

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:104:13
         foreach (var coke in cokes)
         {
             coke.Proportion.Value = coke.Proportion.Value / TotalProportion.Value * 100;
-            tempTotalProportion += coke.Proportion.Value;
+            tempTotalProportion -= coke.Proportion.Value;
         }
 
