[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:128:5
     /// <param name="ironOre"></param>
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(IronOre ironOre)
-    {
-        if (TotalProportion.Value + ironOre.Proportion.Value > 100)
-        {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");
-        }
-
-        if (ironOres.Count == 0)
-        {
-            unit = ironOre.Weight.Unit;
-        }
-
-        var convertedWeight = ironOre.Weight.GetWeightValue(unit);
-        var newWeight = new Weight(convertedWeight, unit);
-        var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
-
-        TotalProportion.Value += ironOreToAdd.Proportion.Value;
-        ironOres.Add(ironOreToAdd);
-    }
+    {}
 
     /// <summary>

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:143:9
         var newWeight = new Weight(convertedWeight, unit);
         var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
 
-        TotalProportion.Value += ironOreToAdd.Proportion.Value;
+        TotalProportion.Value -= ironOreToAdd.Proportion.Value;
         ironOres.Add(ironOreToAdd);
     }

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:144:9
         var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
 
         TotalProportion.Value += ironOreToAdd.Proportion.Value;
-        ironOres.Add(ironOreToAdd);
+        ;
     }
 

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:151:5
     /// Normalize proportions of iron ores to 100%
     /// </summary>
     public void NormalizeProportions()
-    {
-        var tempTotalProportion = 0d;
-
-        foreach (var ironOre in ironOres)
-        {
-            ironOre.Proportion.Value = ironOre.Proportion.Value / TotalProportion.Value * 100;
-            tempTotalProportion += ironOre.Proportion.Value;
-        }
-
-        TotalProportion.Value = tempTotalProportion;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:155:9
         var tempTotalProportion = 0d;
 
         foreach (var ironOre in ironOres)
-        {
-            ironOre.Proportion.Value = ironOre.Proportion.Value / TotalProportion.Value * 100;
-            tempTotalProportion += ironOre.Proportion.Value;
-        }
+        {}
 
         TotalProportion.Value = tempTotalProportion;

[Killed] Arithmetic mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:156:40
 
         foreach (var ironOre in ironOres)
         {
-            ironOre.Proportion.Value = ironOre.Proportion.Value / TotalProportion.Value * 100;
+            ironOre.Proportion.Value = ironOre.Proportion.Value / TotalProportion.Value / 100;
             tempTotalProportion += ironOre.Proportion.Value;
         }

[Killed] Arithmetic mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:156:40
 
         foreach (var ironOre in ironOres)
         {
-            ironOre.Proportion.Value = ironOre.Proportion.Value / TotalProportion.Value * 100;
+            ironOre.Proportion.Value = ironOre.Proportion.Value * TotalProportion.Value * 100;
             tempTotalProportion += ironOre.Proportion.Value;
         }

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:157:13
         foreach (var ironOre in ironOres)
         {
             ironOre.Proportion.Value = ironOre.Proportion.Value / TotalProportion.Value * 100;
-            tempTotalProportion += ironOre.Proportion.Value;
+            tempTotalProportion -= ironOre.Proportion.Value;
         }
 
