[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/Percentual.cs:22:5
     /// </summary>
     /// <param name="value"></param>
     public Percentual(double value)
-    {
-        if (value < 0 || value > 100)
-        {
-            throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");
-        }
-        Value = value;
-    }
+    {}
 
     /// <summary>

[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/Percentual.cs:25:66
     {
         if (value < 0 || value > 100)
         {
-            throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");
+            throw new ArgumentOutOfRangeException(nameof(value), $"");
         }
         Value = value;
