[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:27:5
     /// <param name="cContent"></param>
     /// <param name="weight"></param>
     public PulverizedCoalInjection(Percentual cContent, Weight weight)
-    {
-        CContent = cContent;
-        Weight = weight;
-    }
+    {}
 
     /// <summary>
