[Killed] String mutation
src/csharp/BlastFurnace.MassBalance.Lib/About.cs:13:49
         private static readonly string paragraph1 = "Este programa realiza um cálculo de carga simplificado para um alto forno, " +
                                                 "feito com base nos exercícios feitos em sala de aula e, também, com base nos " +
                                                 "conhecimentos do grupo, tanto na montagem da linha de pensamento como na " +
-                                                "montagem do programa usando a linguagem Pascal.";
+                                                "";
 
         private static readonly string paragraph2 = "\r\n" + "O programa considera o carregamento de até 3 tipos de minérios " +

[Killed] String mutation
src/csharp/BlastFurnace.MassBalance.Lib/About.cs:18:53
         private static readonly string paragraph2 = "\r\n" + "O programa considera o carregamento de até 3 tipos de minérios " +
                                                 "(estes podem ser os minérios, pelotas e sínteres).";
 
-        private static readonly string paragraph3 = "\r\n" + "A partir de uma proporção em peso fixa, a carga de minérios é calculada. " +
+        private static readonly string paragraph3 = "" + "A partir de uma proporção em peso fixa, a carga de minérios é calculada. " +
                                                 "Calcula-se também o teor médio de ferro contido nela.";
 

[Killed] String mutation
src/csharp/BlastFurnace.MassBalance.Lib/About.cs:36:53
                                                 "wustita a ferro se processam integralmente a 900 °C, de forma que a " +
                                                 "reação de redução seja:";
 
-        private static readonly string paragraph8 = "\r\n" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";
+        private static readonly string paragraph8 = "" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";
 
         private static readonly string paragraph9 = "\r\n" + "Após o uso do programa, pode-se armazenar os dados em um arquivo texto " +
