[Killed] Arithmetic mutation
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:71:41
 
             foreach (var coke in cokes)
             {
-                averageCContentValue += coke.CContent.Value * coke.Proportion.Value / currentTotalProportion;
+                averageCContentValue += coke.CContent.Value * coke.Proportion.Value * currentTotalProportion;
             }
 

[Killed] Equality mutation
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:87:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(Coke coke)
     {
-        if (TotalProportion.Value + coke.Proportion.Value > 100)
+        if (TotalProportion.Value + coke.Proportion.Value >= 100)
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");

[Killed] Negate expression
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:87:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(Coke coke)
     {
-        if (TotalProportion.Value + coke.Proportion.Value > 100)
+        if (!(TotalProportion.Value + coke.Proportion.Value > 100))
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");

[Killed] String mutation
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:89:49
     {
         if (TotalProportion.Value + coke.Proportion.Value > 100)
         {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
+            throw new InvalidOperationException("");
         }
 

[Killed] Arithmetic mutation
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:114:38
 
         foreach (var coke in cokes)
         {
-            coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value * 100);
+            coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value / 100);
             tempTotalProportion += coke.Proportion.Value;
         }

[Killed] Arithmetic mutation
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:166:94
         var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
 
         // Number of kmols of carbon required to be loaded at blast furnace
-        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
+        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg * atomicWeightCarbon;
 
         // Mass of Carbon that must be loaded at blast furnace
