[Killed] Arithmetic mutation
src/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:113:42
 
             foreach (var ironOre in ironOres)
             {
-                averageFeContentValue += ironOre.FeContent.Value * ironOre.Proportion.Value / currentTotalProportion;
+                averageFeContentValue += ironOre.FeContent.Value / ironOre.Proportion.Value / currentTotalProportion;
             }
 

[Killed] Arithmetic mutation
src/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:129:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(IronOre ironOre)
     {
-        if (TotalProportion.Value + ironOre.Proportion.Value > 100)
+        if (TotalProportion.Value - ironOre.Proportion.Value > 100)
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");
