[Killed] Equality mutation
src/csharp/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:54:13
     /// <exception cref="InvalidOperationException"></exception>
     public void SetWeight(Weight weight)
     {
-        if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
+        if (weight.GetWeightValue(WeightUnits.metricTon) >= maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
         {
             throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");
