[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/About.cs:31:62
         private static readonly string paragraph6 = "\r\n" + "O sopro pode ser calculado, considerando-se a necessidade de oxigênio e " +
                                                 "o seu teor no sopro.";
 
-        private static readonly string paragraph7 = "\r\n" + "Os cálculos são feitos com base nas considerações de que todo o ferro " +
+        private static readonly string paragraph7 = "\r\n" + "" +
                                                 "carregado é reduzido e se incorpora ao gusa líquido e a reação de redução da " +
                                                 "wustita a ferro se processam integralmente a 900 °C, de forma que a " +

[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/About.cs:36:62
                                                 "wustita a ferro se processam integralmente a 900 °C, de forma que a " +
                                                 "reação de redução seja:";
 
-        private static readonly string paragraph8 = "\r\n" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";
+        private static readonly string paragraph8 = "\r\n" + "";
 
         private static readonly string paragraph9 = "\r\n" + "Após o uso do programa, pode-se armazenar os dados em um arquivo texto " +

[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/About.cs:76:24
         {
             get
             {
-                return "Blast Furnace Mass Balance Application";
+                return "";
             }
         }
