[Killed] Negate expression
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/HotMetal.cs:36:13
     /// <param name="cPercent"></param>
     public HotMetal(Weight weight, Percentual fePercent, Percentual cPercent)
     {
-        if (fePercent.Value + cPercent.Value > 100)
+        if (!(fePercent.Value + cPercent.Value > 100))
         {
             throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");
