[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:156:13
 
         foreach (var ironOre in ironOres)
         {
-            ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value * 100);
+            ;
             tempTotalProportion += ironOre.Proportion.Value;
         }
