[Killed] Negate expression
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/Percentual.cs:32:13
     /// <param name="value"></param>
     public void SetValue(double value)
     {
-        if (value < 0 || value > 100)
+        if (!(value < 0 || value > 100))
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/Percentual.cs:32:13
     /// <param name="value"></param>
     public void SetValue(double value)
     {
-        if (value < 0 || value > 100)
+        if (value > 0 || value > 100)
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");
