[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:56:49
     {
         if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
         {
-            throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");
+            throw new InvalidOperationException($"");
         }
         this.Weight = new Weight(weight.Value, weight.Unit);
