[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:16:5
     /// <param name="hotMetal"></param>
     /// <returns>A handle of this instance after adding Hot Metal to the object</returns>
     public BlastFurnaceCharge AddHotMetal(HotMetal hotMetal)
-    {
-        if (HotMetal != null)
-        {
-            throw new InvalidOperationException("Hot Metal has been already initialized. You can edit it but not change the instance.");
-        }
-        HotMetal = hotMetal;
-        return this;
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:17:13
     /// <returns>A handle of this instance after adding Hot Metal to the object</returns>
     public BlastFurnaceCharge AddHotMetal(HotMetal hotMetal)
     {
-        if (HotMetal != null)
+        if (HotMetal == null)
         {
             throw new InvalidOperationException("Hot Metal has been already initialized. You can edit it but not change the instance.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:18:9
     public BlastFurnaceCharge AddHotMetal(HotMetal hotMetal)
     {
         if (HotMetal != null)
-        {
-            throw new InvalidOperationException("Hot Metal has been already initialized. You can edit it but not change the instance.");
-        }
+        {}
         HotMetal = hotMetal;
         return this;
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:19:13
     {
         if (HotMetal != null)
         {
-            throw new InvalidOperationException("Hot Metal has been already initialized. You can edit it but not change the instance.");
+            ;
         }
         HotMetal = hotMetal;
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:31:5
     /// <param name="ironOreBlend"></param>
     /// <returns>A handle of this instance after adding Iron Ore Blend to the object</returns>
     public BlastFurnaceCharge AddIronOreBlend(IronOreBlend ironOreBlend)
-    {
-        if (IronOreBlend != null)
-        {
-            throw new InvalidOperationException("Iron Ore Blend has been already initialized. You can edit it but not change the instance.");
-        }
-        IronOreBlend = ironOreBlend;
-        return this;
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:32:13
     /// <returns>A handle of this instance after adding Iron Ore Blend to the object</returns>
     public BlastFurnaceCharge AddIronOreBlend(IronOreBlend ironOreBlend)
     {
-        if (IronOreBlend != null)
+        if (IronOreBlend == null)
         {
             throw new InvalidOperationException("Iron Ore Blend has been already initialized. You can edit it but not change the instance.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:33:9
     public BlastFurnaceCharge AddIronOreBlend(IronOreBlend ironOreBlend)
     {
         if (IronOreBlend != null)
-        {
-            throw new InvalidOperationException("Iron Ore Blend has been already initialized. You can edit it but not change the instance.");
-        }
+        {}
         IronOreBlend = ironOreBlend;
         return this;
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:34:13
     {
         if (IronOreBlend != null)
         {
-            throw new InvalidOperationException("Iron Ore Blend has been already initialized. You can edit it but not change the instance.");
+            ;
         }
         IronOreBlend = ironOreBlend;
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:46:5
     /// <param name="cokeBlend"></param>
     /// <returns>A handle of this instance after adding Coke Blend to the object</returns>
     public BlastFurnaceCharge AddCokeBlend(CokeBlend cokeBlend)
-    {
-        if (CokeBlend != null)
-        {
-            throw new InvalidOperationException("Coke Blend has been already initialized. You can edit it but not change the instance.");
-        }
-        CokeBlend = cokeBlend;
-        return this;
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:47:13
     /// <returns>A handle of this instance after adding Coke Blend to the object</returns>
     public BlastFurnaceCharge AddCokeBlend(CokeBlend cokeBlend)
     {
-        if (CokeBlend != null)
+        if (CokeBlend == null)
         {
             throw new InvalidOperationException("Coke Blend has been already initialized. You can edit it but not change the instance.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:48:9
     public BlastFurnaceCharge AddCokeBlend(CokeBlend cokeBlend)
     {
         if (CokeBlend != null)
-        {
-            throw new InvalidOperationException("Coke Blend has been already initialized. You can edit it but not change the instance.");
-        }
+        {}
         CokeBlend = cokeBlend;
         return this;
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:49:13
     {
         if (CokeBlend != null)
         {
-            throw new InvalidOperationException("Coke Blend has been already initialized. You can edit it but not change the instance.");
+            ;
         }
         CokeBlend = cokeBlend;
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:61:5
     /// <param name="pci"></param>
     /// <returns>A handle of this instance after adding Pulverized Coal Injection to the object</returns>
     public BlastFurnaceCharge AddPCI(PulverizedCoalInjection pci)
-    {
-        if (PCI != null)
-        {
-            throw new InvalidOperationException("Pulverized Coal Injection has been already initialized. You can edit it but not change the instance.");
-        }
-        PCI = pci;
-        return this;
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:62:13
     /// <returns>A handle of this instance after adding Pulverized Coal Injection to the object</returns>
     public BlastFurnaceCharge AddPCI(PulverizedCoalInjection pci)
     {
-        if (PCI != null)
+        if (PCI == null)
         {
             throw new InvalidOperationException("Pulverized Coal Injection has been already initialized. You can edit it but not change the instance.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:63:9
     public BlastFurnaceCharge AddPCI(PulverizedCoalInjection pci)
     {
         if (PCI != null)
-        {
-            throw new InvalidOperationException("Pulverized Coal Injection has been already initialized. You can edit it but not change the instance.");
-        }
+        {}
         PCI = pci;
         return this;
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:64:13
     {
         if (PCI != null)
         {
-            throw new InvalidOperationException("Pulverized Coal Injection has been already initialized. You can edit it but not change the instance.");
+            ;
         }
         PCI = pci;
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:76:5
     /// <param name="airBlow"></param>
     /// <returns>A handle of this instance after adding Air Blow to the object</returns>
     public BlastFurnaceCharge AddAirBlow(AirBlow airBlow)
-    {
-        if (AirBlow != null)
-        {
-            throw new InvalidOperationException("Air Blow has been already initialized. You can edit it but not change the instance.");
-        }
-        AirBlow = airBlow;
-        return this;
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:77:13
     /// <returns>A handle of this instance after adding Air Blow to the object</returns>
     public BlastFurnaceCharge AddAirBlow(AirBlow airBlow)
     {
-        if (AirBlow != null)
+        if (AirBlow == null)
         {
             throw new InvalidOperationException("Air Blow has been already initialized. You can edit it but not change the instance.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:78:9
     public BlastFurnaceCharge AddAirBlow(AirBlow airBlow)
     {
         if (AirBlow != null)
-        {
-            throw new InvalidOperationException("Air Blow has been already initialized. You can edit it but not change the instance.");
-        }
+        {}
         AirBlow = airBlow;
         return this;
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:79:13
     {
         if (AirBlow != null)
         {
-            throw new InvalidOperationException("Air Blow has been already initialized. You can edit it but not change the instance.");
+            ;
         }
         AirBlow = airBlow;
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:89:5
     /// Set iron ore weights based on hot metal setup
     /// </summary>
     public void SetIronOreWeights()
-    {
-        if (HotMetal == null)
-        {
-            throw new InvalidOperationException("Hot metal is not fully defined. Firstly set hot metal parameters before calculating iron ore weights.");
-        }
-
-        if (IronOreBlend == null)
-        {
-            throw new InvalidOperationException("Iron ore blend is not fully defined. Firstly set iron ore blend parameters before calculating iron ore weights.");
-        }
-
-        IronOreBlend.SetIronOreWeightsBasedOnRequiredWeight(HotMetal);
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:90:13
     /// </summary>
     public void SetIronOreWeights()
     {
-        if (HotMetal == null)
+        if (HotMetal != null)
         {
             throw new InvalidOperationException("Hot metal is not fully defined. Firstly set hot metal parameters before calculating iron ore weights.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:91:9
     public void SetIronOreWeights()
     {
         if (HotMetal == null)
-        {
-            throw new InvalidOperationException("Hot metal is not fully defined. Firstly set hot metal parameters before calculating iron ore weights.");
-        }
+        {}
 
         if (IronOreBlend == null)
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:92:13
     {
         if (HotMetal == null)
         {
-            throw new InvalidOperationException("Hot metal is not fully defined. Firstly set hot metal parameters before calculating iron ore weights.");
+            ;
         }
 
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:95:13
             throw new InvalidOperationException("Hot metal is not fully defined. Firstly set hot metal parameters before calculating iron ore weights.");
         }
 
-        if (IronOreBlend == null)
+        if (IronOreBlend != null)
         {
             throw new InvalidOperationException("Iron ore blend is not fully defined. Firstly set iron ore blend parameters before calculating iron ore weights.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:96:9
         }
 
         if (IronOreBlend == null)
-        {
-            throw new InvalidOperationException("Iron ore blend is not fully defined. Firstly set iron ore blend parameters before calculating iron ore weights.");
-        }
+        {}
 
         IronOreBlend.SetIronOreWeightsBasedOnRequiredWeight(HotMetal);
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:97:13
 
         if (IronOreBlend == null)
         {
-            throw new InvalidOperationException("Iron ore blend is not fully defined. Firstly set iron ore blend parameters before calculating iron ore weights.");
+            ;
         }
 
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:100:9
             throw new InvalidOperationException("Iron ore blend is not fully defined. Firstly set iron ore blend parameters before calculating iron ore weights.");
         }
 
-        IronOreBlend.SetIronOreWeightsBasedOnRequiredWeight(HotMetal);
+        ;
     }
 
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:108:5
     /// </summary>
     /// <returns></returns>
     public double GetFuelRate()
-    {
-        if (CokeBlend == null)
-        {
-            throw new InvalidOperationException($"{nameof(CokeBlend)} is currently not configured properly. It is not possible to calculate fuel rate.");
-        }
-
-        if (PCI == null)
-        {
-            throw new InvalidOperationException($"{nameof(PCI)} is currently not configured properly. It is not possible to calculate fuel rate.");
-        }
-
-        if (HotMetal == null)
-        {
-            throw new InvalidOperationException($"{nameof(HotMetal)} is currently not configured properly. It is not possible to calculate fuel rate.");
-        }
-
-        return CokeBlend.CokeRate(HotMetal, PCI) + PCI.PCIRate(HotMetal);
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:109:13
     /// <returns></returns>
     public double GetFuelRate()
     {
-        if (CokeBlend == null)
+        if (CokeBlend != null)
         {
             throw new InvalidOperationException($"{nameof(CokeBlend)} is currently not configured properly. It is not possible to calculate fuel rate.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:110:9
     public double GetFuelRate()
     {
         if (CokeBlend == null)
-        {
-            throw new InvalidOperationException($"{nameof(CokeBlend)} is currently not configured properly. It is not possible to calculate fuel rate.");
-        }
+        {}
 
         if (PCI == null)
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:111:13
     {
         if (CokeBlend == null)
         {
-            throw new InvalidOperationException($"{nameof(CokeBlend)} is currently not configured properly. It is not possible to calculate fuel rate.");
+            ;
         }
 
statusReason: Mutant changed compared to target commit

[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:111:49
     {
         if (CokeBlend == null)
         {
-            throw new InvalidOperationException($"{nameof(CokeBlend)} is currently not configured properly. It is not possible to calculate fuel rate.");
+            throw new InvalidOperationException($"");
         }
 
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:114:13
             throw new InvalidOperationException($"{nameof(CokeBlend)} is currently not configured properly. It is not possible to calculate fuel rate.");
         }
 
-        if (PCI == null)
+        if (PCI != null)
         {
             throw new InvalidOperationException($"{nameof(PCI)} is currently not configured properly. It is not possible to calculate fuel rate.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:115:9
         }
 
         if (PCI == null)
-        {
-            throw new InvalidOperationException($"{nameof(PCI)} is currently not configured properly. It is not possible to calculate fuel rate.");
-        }
+        {}
 
         if (HotMetal == null)
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:116:13
 
         if (PCI == null)
         {
-            throw new InvalidOperationException($"{nameof(PCI)} is currently not configured properly. It is not possible to calculate fuel rate.");
+            ;
         }
 
statusReason: Mutant changed compared to target commit

[Killed] Equality mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:119:13
             throw new InvalidOperationException($"{nameof(PCI)} is currently not configured properly. It is not possible to calculate fuel rate.");
         }
 
-        if (HotMetal == null)
+        if (HotMetal != null)
         {
             throw new InvalidOperationException($"{nameof(HotMetal)} is currently not configured properly. It is not possible to calculate fuel rate.");
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:120:9
         }
 
         if (HotMetal == null)
-        {
-            throw new InvalidOperationException($"{nameof(HotMetal)} is currently not configured properly. It is not possible to calculate fuel rate.");
-        }
+        {}
 
         return CokeBlend.CokeRate(HotMetal, PCI) + PCI.PCIRate(HotMetal);
statusReason: Mutant changed compared to target commit

[Killed] Statement mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:121:13
 
         if (HotMetal == null)
         {
-            throw new InvalidOperationException($"{nameof(HotMetal)} is currently not configured properly. It is not possible to calculate fuel rate.");
+            ;
         }
 
statusReason: Mutant changed compared to target commit

[Killed] String mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:121:49
 
         if (HotMetal == null)
         {
-            throw new InvalidOperationException($"{nameof(HotMetal)} is currently not configured properly. It is not possible to calculate fuel rate.");
+            throw new InvalidOperationException($"");
         }
 
statusReason: Mutant changed compared to target commit

[Killed] Arithmetic mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:124:16
             throw new InvalidOperationException($"{nameof(HotMetal)} is currently not configured properly. It is not possible to calculate fuel rate.");
         }
 
-        return CokeBlend.CokeRate(HotMetal, PCI) + PCI.PCIRate(HotMetal);
+        return CokeBlend.CokeRate(HotMetal, PCI) - PCI.PCIRate(HotMetal);
     }
 
statusReason: Mutant changed compared to target commit

[Killed] Block removal mutation
blast-furnace-mass-balance/csharp/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:149:5
         CokeBlend cokeBlend,
         PulverizedCoalInjection pci,
         AirBlow airBlow)
-    {
-        HotMetal = hotMetal;
-        IronOreBlend = ironOreBlend;
-        CokeBlend = cokeBlend;
-        PCI = pci;
-        AirBlow = airBlow;
-    }
+    {}
 
     /// <summary>
statusReason: Mutant changed compared to target commit
