[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:10:53
     /// </summary>
     public static class About
     {
-        private static readonly string paragraph1 = "Este programa realiza um cálculo de carga simplificado para um alto forno, " +
+        private static readonly string paragraph1 = "" +
                                                 "feito com base nos exercícios feitos em sala de aula e, também, com base nos " +
                                                 "conhecimentos do grupo, tanto na montagem da linha de pensamento como na " +

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:15:53
                                                 "conhecimentos do grupo, tanto na montagem da linha de pensamento como na " +
                                                 "montagem do programa usando a linguagem Pascal.";
 
-        private static readonly string paragraph2 = "\r\n" + "O programa considera o carregamento de até 3 tipos de minérios " +
+        private static readonly string paragraph2 = "" + "O programa considera o carregamento de até 3 tipos de minérios " +
                                                 "(estes podem ser os minérios, pelotas e sínteres).";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:19:49
                                                 "(estes podem ser os minérios, pelotas e sínteres).";
 
         private static readonly string paragraph3 = "\r\n" + "A partir de uma proporção em peso fixa, a carga de minérios é calculada. " +
-                                                "Calcula-se também o teor médio de ferro contido nela.";
+                                                "";
 
         private static readonly string paragraph4 = "\r\n" + "A carga de coque é feita de forma similar: estipula-se a proporção dos " +

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:21:62
         private static readonly string paragraph3 = "\r\n" + "A partir de uma proporção em peso fixa, a carga de minérios é calculada. " +
                                                 "Calcula-se também o teor médio de ferro contido nela.";
 
-        private static readonly string paragraph4 = "\r\n" + "A carga de coque é feita de forma similar: estipula-se a proporção dos " +
+        private static readonly string paragraph4 = "\r\n" + "" +
                                                 "diferentes tipos de coque (no máximo 3) e calcula-se a massa de cada um deles" +
                                                 "para atender ao processo.";

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:23:49
 
         private static readonly string paragraph4 = "\r\n" + "A carga de coque é feita de forma similar: estipula-se a proporção dos " +
                                                 "diferentes tipos de coque (no máximo 3) e calcula-se a massa de cada um deles" +
-                                                "para atender ao processo.";
+                                                "";
 
         private static readonly string paragraph5 = "\r\n" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:25:53
                                                 "diferentes tipos de coque (no máximo 3) e calcula-se a massa de cada um deles" +
                                                 "para atender ao processo.";
 
-        private static readonly string paragraph5 = "\r\n" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +
+        private static readonly string paragraph5 = "" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +
                                                 "estipular um valor a ser usado.";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:25:62
                                                 "diferentes tipos de coque (no máximo 3) e calcula-se a massa de cada um deles" +
                                                 "para atender ao processo.";
 
-        private static readonly string paragraph5 = "\r\n" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +
+        private static readonly string paragraph5 = "\r\n" + "" +
                                                 "estipular um valor a ser usado.";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:26:49
                                                 "para atender ao processo.";
 
         private static readonly string paragraph5 = "\r\n" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +
-                                                "estipular um valor a ser usado.";
+                                                "";
 
         private static readonly string paragraph6 = "\r\n" + "O sopro pode ser calculado, considerando-se a necessidade de oxigênio e " +

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:28:62
         private static readonly string paragraph5 = "\r\n" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +
                                                 "estipular um valor a ser usado.";
 
-        private static readonly string paragraph6 = "\r\n" + "O sopro pode ser calculado, considerando-se a necessidade de oxigênio e " +
+        private static readonly string paragraph6 = "\r\n" + "" +
                                                 "o seu teor no sopro.";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:28:53
         private static readonly string paragraph5 = "\r\n" + "Pode-se calcular a quantidade de PCI máxima a se injetar, e a partir dela, " +
                                                 "estipular um valor a ser usado.";
 
-        private static readonly string paragraph6 = "\r\n" + "O sopro pode ser calculado, considerando-se a necessidade de oxigênio e " +
+        private static readonly string paragraph6 = "" + "O sopro pode ser calculado, considerando-se a necessidade de oxigênio e " +
                                                 "o seu teor no sopro.";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:31:53
         private static readonly string paragraph6 = "\r\n" + "O sopro pode ser calculado, considerando-se a necessidade de oxigênio e " +
                                                 "o seu teor no sopro.";
 
-        private static readonly string paragraph7 = "\r\n" + "Os cálculos são feitos com base nas considerações de que todo o ferro " +
+        private static readonly string paragraph7 = "" + "Os cálculos são feitos com base nas considerações de que todo o ferro " +
                                                 "carregado é reduzido e se incorpora ao gusa líquido e a reação de redução da " +
                                                 "wustita a ferro se processam integralmente a 900 °C, de forma que a " +

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:32:49
                                                 "o seu teor no sopro.";
 
         private static readonly string paragraph7 = "\r\n" + "Os cálculos são feitos com base nas considerações de que todo o ferro " +
-                                                "carregado é reduzido e se incorpora ao gusa líquido e a reação de redução da " +
+                                                "" +
                                                 "wustita a ferro se processam integralmente a 900 °C, de forma que a " +
                                                 "reação de redução seja:";

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:33:49
 
         private static readonly string paragraph7 = "\r\n" + "Os cálculos são feitos com base nas considerações de que todo o ferro " +
                                                 "carregado é reduzido e se incorpora ao gusa líquido e a reação de redução da " +
-                                                "wustita a ferro se processam integralmente a 900 °C, de forma que a " +
+                                                "" +
                                                 "reação de redução seja:";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:34:49
         private static readonly string paragraph7 = "\r\n" + "Os cálculos são feitos com base nas considerações de que todo o ferro " +
                                                 "carregado é reduzido e se incorpora ao gusa líquido e a reação de redução da " +
                                                 "wustita a ferro se processam integralmente a 900 °C, de forma que a " +
-                                                "reação de redução seja:";
+                                                "";
 
         private static readonly string paragraph8 = "\r\n" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:38:53
 
         private static readonly string paragraph8 = "\r\n" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";
 
-        private static readonly string paragraph9 = "\r\n" + "Após o uso do programa, pode-se armazenar os dados em um arquivo texto " +
+        private static readonly string paragraph9 = "" + "Após o uso do programa, pode-se armazenar os dados em um arquivo texto " +
                                                 "(Calculo_de_carga.doc)";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:38:62
 
         private static readonly string paragraph8 = "\r\n" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";
 
-        private static readonly string paragraph9 = "\r\n" + "Após o uso do programa, pode-se armazenar os dados em um arquivo texto " +
+        private static readonly string paragraph9 = "\r\n" + "" +
                                                 "(Calculo_de_carga.doc)";
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:39:49
         private static readonly string paragraph8 = "\r\n" + "FeO +3,12CO = Fe + 2,12 CO + CO2.";
 
         private static readonly string paragraph9 = "\r\n" + "Após o uso do programa, pode-se armazenar os dados em um arquivo texto " +
-                                                "(Calculo_de_carga.doc)";
+                                                "";
 
         private static string GetDescription()

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:42:9
                                                 "(Calculo_de_carga.doc)";
 
         private static string GetDescription()
-        {
-            var sb = new StringBuilder();
-
-            sb.AppendLine(paragraph1);
-            sb.AppendLine(paragraph2);
-            sb.AppendLine(paragraph3);
-            sb.AppendLine(paragraph4);
-            sb.AppendLine(paragraph5);
-            sb.AppendLine(paragraph6);
-            sb.AppendLine(paragraph7);
-            sb.AppendLine(paragraph8);
-            sb.AppendLine(paragraph9);
-
-            return sb.ToString();
-        }
+        {}
 
         /// <summary>

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:45:13
         {
             var sb = new StringBuilder();
 
-            sb.AppendLine(paragraph1);
+            ;
             sb.AppendLine(paragraph2);
             sb.AppendLine(paragraph3);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:46:13
             var sb = new StringBuilder();
 
             sb.AppendLine(paragraph1);
-            sb.AppendLine(paragraph2);
+            ;
             sb.AppendLine(paragraph3);
             sb.AppendLine(paragraph4);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:47:13
 
             sb.AppendLine(paragraph1);
             sb.AppendLine(paragraph2);
-            sb.AppendLine(paragraph3);
+            ;
             sb.AppendLine(paragraph4);
             sb.AppendLine(paragraph5);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:48:13
             sb.AppendLine(paragraph1);
             sb.AppendLine(paragraph2);
             sb.AppendLine(paragraph3);
-            sb.AppendLine(paragraph4);
+            ;
             sb.AppendLine(paragraph5);
             sb.AppendLine(paragraph6);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:49:13
             sb.AppendLine(paragraph2);
             sb.AppendLine(paragraph3);
             sb.AppendLine(paragraph4);
-            sb.AppendLine(paragraph5);
+            ;
             sb.AppendLine(paragraph6);
             sb.AppendLine(paragraph7);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:50:13
             sb.AppendLine(paragraph3);
             sb.AppendLine(paragraph4);
             sb.AppendLine(paragraph5);
-            sb.AppendLine(paragraph6);
+            ;
             sb.AppendLine(paragraph7);
             sb.AppendLine(paragraph8);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:51:13
             sb.AppendLine(paragraph4);
             sb.AppendLine(paragraph5);
             sb.AppendLine(paragraph6);
-            sb.AppendLine(paragraph7);
+            ;
             sb.AppendLine(paragraph8);
             sb.AppendLine(paragraph9);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:52:13
             sb.AppendLine(paragraph5);
             sb.AppendLine(paragraph6);
             sb.AppendLine(paragraph7);
-            sb.AppendLine(paragraph8);
+            ;
             sb.AppendLine(paragraph9);
 

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:53:13
             sb.AppendLine(paragraph6);
             sb.AppendLine(paragraph7);
             sb.AppendLine(paragraph8);
-            sb.AppendLine(paragraph9);
+            ;
 
             return sb.ToString();

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:64:13
         public static string Description
         {
             get
-            {
-                return GetDescription();
-            }
+            {}
         }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/About.cs:75:13
         public static string AppTitle
         {
             get
-            {
-                return "Blast Furnace Mass Balance Application";
-            }
+            {}
         }
     }
