[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:22:5
     /// </summary>
     /// <param name="o2Content"></param>
     public AirBlow(Percentual o2Content)
-    {
-        O2Content = o2Content;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:33:5
     /// <returns></returns>
     /// <exception cref="ArgumentNullException"></exception>
     public Volume GetRequiredAirVolume(HotMetal hotMetal)
-    {
-        if (hotMetal == null)
-        {
-            throw new ArgumentNullException(nameof(hotMetal));
-        }
-
-        var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
-        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
-
-        var requiredOxygenVolume = 0.224 * feWeightInHotMetalInKg;
-
-        var requiredAirVolumeValue = requiredOxygenVolume / (O2Content.Value / 100);
-
-        var requiredAirVolume = new Volume(requiredAirVolumeValue, VolumeUnits.Nm3);
-        return requiredAirVolume;
-    }
+    {}
 
     /// <summary>

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:34:13
     /// <exception cref="ArgumentNullException"></exception>
     public Volume GetRequiredAirVolume(HotMetal hotMetal)
     {
-        if (hotMetal == null)
+        if (hotMetal != null)
         {
             throw new ArgumentNullException(nameof(hotMetal));

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:35:9
     public Volume GetRequiredAirVolume(HotMetal hotMetal)
     {
         if (hotMetal == null)
-        {
-            throw new ArgumentNullException(nameof(hotMetal));
-        }
+        {}
 
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:36:13
     {
         if (hotMetal == null)
         {
-            throw new ArgumentNullException(nameof(hotMetal));
+            ;
         }
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:40:38
         }
 
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
-        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
+        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value * 100;
 
         var requiredOxygenVolume = 0.224 * feWeightInHotMetalInKg;

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:40:38
         }
 
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
-        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
+        var feWeightInHotMetalInKg = hotMetalWeightinKg / hotMetal.FePercent.Value / 100;
 
         var requiredOxygenVolume = 0.224 * feWeightInHotMetalInKg;

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:42:36
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
         var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
 
-        var requiredOxygenVolume = 0.224 * feWeightInHotMetalInKg;
+        var requiredOxygenVolume = 0.224 / feWeightInHotMetalInKg;
 
         var requiredAirVolumeValue = requiredOxygenVolume / (O2Content.Value / 100);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:44:38
 
         var requiredOxygenVolume = 0.224 * feWeightInHotMetalInKg;
 
-        var requiredAirVolumeValue = requiredOxygenVolume / (O2Content.Value / 100);
+        var requiredAirVolumeValue = requiredOxygenVolume * (O2Content.Value / 100);
 
         var requiredAirVolume = new Volume(requiredAirVolumeValue, VolumeUnits.Nm3);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:44:62
 
         var requiredOxygenVolume = 0.224 * feWeightInHotMetalInKg;
 
-        var requiredAirVolumeValue = requiredOxygenVolume / (O2Content.Value / 100);
+        var requiredAirVolumeValue = requiredOxygenVolume / (O2Content.Value * 100);
 
         var requiredAirVolume = new Volume(requiredAirVolumeValue, VolumeUnits.Nm3);

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:55:5
     /// </summary>
     /// <returns></returns>
     public double AirBlowRateRequiredPerMinute(HotMetal hotMetal)
-    {
-        if (hotMetal == null)
-        {
-            throw new ArgumentNullException(nameof(hotMetal));
-        }
-
-        var blowRate = GetRequiredAirVolume(hotMetal).GetVolumeValue(VolumeUnits.Nm3) / 1440;
-
-        return blowRate;
-    }
+    {}
 
     /// <summary>

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:61:24
             throw new ArgumentNullException(nameof(hotMetal));
         }
 
-        var blowRate = GetRequiredAirVolume(hotMetal).GetVolumeValue(VolumeUnits.Nm3) / 1440;
+        var blowRate = GetRequiredAirVolume(hotMetal).GetVolumeValue(VolumeUnits.Nm3) * 1440;
 
         return blowRate;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/AirBlow.cs:71:5
     /// </summary>
     /// <returns></returns>
     public override string ToString()
-    {
-        var jsonRepresentation = JsonConvert.SerializeObject(this, Formatting.Indented);
-        return jsonRepresentation.ToString();
-    }
+    {}
 }
 
