[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:19:49
     {
         if (HotMetal != null)
         {
-            throw new InvalidOperationException("Hot Metal has been already initialized. You can edit it but not change the instance.");
+            throw new InvalidOperationException("");
         }
         HotMetal = hotMetal;

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:64:49
     {
         if (PCI != null)
         {
-            throw new InvalidOperationException("Pulverized Coal Injection has been already initialized. You can edit it but not change the instance.");
+            throw new InvalidOperationException("");
         }
         PCI = pci;

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/BlastFurnaceCharge.cs:92:49
     {
         if (HotMetal == null)
         {
-            throw new InvalidOperationException("Hot metal is not fully defined. Firstly set hot metal parameters before calculating iron ore weights.");
+            throw new InvalidOperationException("");
         }
 
