[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Coke.cs:27:5
     /// <param name="cContent"></param>
     /// <param name="proportion"></param>
     public Coke(Percentual cContent, Percentual proportion)
-    {
-        CContent = cContent;
-        Proportion = proportion;
-        Weight = new Weight(0, WeightUnits.metricTon);
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Coke.cs:40:5
     /// <param name="proportion"></param>
     /// <param name="weight"></param>
     public Coke(Percentual cContent, Percentual proportion, Weight weight)
-    {
-        CContent = cContent;
-        Proportion = proportion;
-        Weight = weight;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Coke.cs:57:5
     /// <param name="newValue"></param>
     /// <param name="newUnit"></param>
     public void SetWeight(double newValue, WeightUnits newUnit)
-    {
-        var newWeight = new Weight(newValue, newUnit);
-        Weight = newWeight;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Coke.cs:67:5
     /// </summary>
     /// <returns></returns>
     public override string ToString()
-    {
-        // https://code-maze.com/csharp-serialize-enum-to-string/
-        var serializerSettings = new JsonSerializerSettings();
-        serializerSettings.Converters.Add(new StringEnumConverter());
-
-        var jsonRepresentation = JsonConvert.SerializeObject(this, Formatting.Indented, serializerSettings);
-        return jsonRepresentation.ToString();
-    }
+    {}
 }
 

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/Coke.cs:70:9
     {
         // https://code-maze.com/csharp-serialize-enum-to-string/
         var serializerSettings = new JsonSerializerSettings();
-        serializerSettings.Converters.Add(new StringEnumConverter());
+        ;
 
         var jsonRepresentation = JsonConvert.SerializeObject(this, Formatting.Indented, serializerSettings);
