[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:22:5
     /// Initialization of coke blend
     /// </summary>
     public CokeBlend()
-    {
-        cokes = new List<Coke>();
-        TotalProportion = new Percentual(0);
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:33:9
     public ReadOnlyCollection<Coke> Cokes
     {
         get
-        {
-            return cokes.AsReadOnly();
-        }
+        {}
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:53:9
     public Percentual AverageCContent
     {
         get
-        {
-            var currentTotalProportion = 0.0d;
-            if (TotalProportion.Value == 100)
-            {
-                currentTotalProportion = 100;
-            }
-            else
-            {
-                foreach (var coke in cokes)
-                {
-                    currentTotalProportion += coke.Proportion.Value;
-                }
-            }
-
-            var averageCContentValue = 0.0d;
-
-            foreach (var coke in cokes)
-            {
-                averageCContentValue += coke.CContent.Value * coke.Proportion.Value / currentTotalProportion;
-            }
-
-            var averageCContent = new Percentual(averageCContentValue);
-
-            return averageCContent;
-        }
+        {}
     }
 

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:55:17
         get
         {
             var currentTotalProportion = 0.0d;
-            if (TotalProportion.Value == 100)
+            if (TotalProportion.Value != 100)
             {
                 currentTotalProportion = 100;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:56:13
         {
             var currentTotalProportion = 0.0d;
             if (TotalProportion.Value == 100)
-            {
-                currentTotalProportion = 100;
-            }
+            {}
             else
             {

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:60:13
                 currentTotalProportion = 100;
             }
             else
-            {
-                foreach (var coke in cokes)
-                {
-                    currentTotalProportion += coke.Proportion.Value;
-                }
-            }
+            {}
 
             var averageCContentValue = 0.0d;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:62:17
             else
             {
                 foreach (var coke in cokes)
-                {
-                    currentTotalProportion += coke.Proportion.Value;
-                }
+                {}
             }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:63:21
             {
                 foreach (var coke in cokes)
                 {
-                    currentTotalProportion += coke.Proportion.Value;
+                    currentTotalProportion -= coke.Proportion.Value;
                 }
             }

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:70:13
             var averageCContentValue = 0.0d;
 
             foreach (var coke in cokes)
-            {
-                averageCContentValue += coke.CContent.Value * coke.Proportion.Value / currentTotalProportion;
-            }
+            {}
 
             var averageCContent = new Percentual(averageCContentValue);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:71:41
 
             foreach (var coke in cokes)
             {
-                averageCContentValue += coke.CContent.Value * coke.Proportion.Value / currentTotalProportion;
+                averageCContentValue += coke.CContent.Value / coke.Proportion.Value / currentTotalProportion;
             }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:71:17
 
             foreach (var coke in cokes)
             {
-                averageCContentValue += coke.CContent.Value * coke.Proportion.Value / currentTotalProportion;
+                averageCContentValue -= coke.CContent.Value * coke.Proportion.Value / currentTotalProportion;
             }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:86:5
     /// <param name="coke"></param>
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(Coke coke)
-    {
-        if (TotalProportion.Value + coke.Proportion.Value > 100)
-        {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
-        }
-
-        if (cokes.Count == 0)
-        {
-            unit = coke.Weight.Unit;
-        }
-
-        var convertedWeight = coke.Weight.GetWeightValue(unit);
-        var newWeight = new Weight(convertedWeight, unit);
-        var cokeToAdd = new Coke(coke.CContent, coke.Proportion, newWeight);
-
-        TotalProportion.SetValue(TotalProportion.Value + cokeToAdd.Proportion.Value);
-        cokes.Add(cokeToAdd);
-    }
+    {}
 
     /// <summary>

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:87:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(Coke coke)
     {
-        if (TotalProportion.Value + coke.Proportion.Value > 100)
+        if (TotalProportion.Value + coke.Proportion.Value < 100)
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:87:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(Coke coke)
     {
-        if (TotalProportion.Value + coke.Proportion.Value > 100)
+        if (TotalProportion.Value - coke.Proportion.Value > 100)
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:88:9
     public void Add(Coke coke)
     {
         if (TotalProportion.Value + coke.Proportion.Value > 100)
-        {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
-        }
+        {}
 
         if (cokes.Count == 0)

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:89:13
     {
         if (TotalProportion.Value + coke.Proportion.Value > 100)
         {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
+            ;
         }
 

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:92:13
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%.");
         }
 
-        if (cokes.Count == 0)
+        if (cokes.Count != 0)
         {
             unit = coke.Weight.Unit;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:93:9
         }
 
         if (cokes.Count == 0)
-        {
-            unit = coke.Weight.Unit;
-        }
+        {}
 
         var convertedWeight = coke.Weight.GetWeightValue(unit);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:101:34
         var newWeight = new Weight(convertedWeight, unit);
         var cokeToAdd = new Coke(coke.CContent, coke.Proportion, newWeight);
 
-        TotalProportion.SetValue(TotalProportion.Value + cokeToAdd.Proportion.Value);
+        TotalProportion.SetValue(TotalProportion.Value - cokeToAdd.Proportion.Value);
         cokes.Add(cokeToAdd);
     }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:101:9
         var newWeight = new Weight(convertedWeight, unit);
         var cokeToAdd = new Coke(coke.CContent, coke.Proportion, newWeight);
 
-        TotalProportion.SetValue(TotalProportion.Value + cokeToAdd.Proportion.Value);
+        ;
         cokes.Add(cokeToAdd);
     }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:102:9
         var cokeToAdd = new Coke(coke.CContent, coke.Proportion, newWeight);
 
         TotalProportion.SetValue(TotalProportion.Value + cokeToAdd.Proportion.Value);
-        cokes.Add(cokeToAdd);
+        ;
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:109:5
     /// Normalize proportions of Cokes to 100%
     /// </summary>
     public void NormalizeProportions()
-    {
-        var tempTotalProportion = 0d;
-
-        foreach (var coke in cokes)
-        {
-            coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value * 100);
-            tempTotalProportion += coke.Proportion.Value;
-        }
-
-        TotalProportion.SetValue(tempTotalProportion);
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:113:9
         var tempTotalProportion = 0d;
 
         foreach (var coke in cokes)
-        {
-            coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value * 100);
-            tempTotalProportion += coke.Proportion.Value;
-        }
+        {}
 
         TotalProportion.SetValue(tempTotalProportion);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:114:13
 
         foreach (var coke in cokes)
         {
-            coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value * 100);
+            ;
             tempTotalProportion += coke.Proportion.Value;
         }

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:114:38
 
         foreach (var coke in cokes)
         {
-            coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value * 100);
+            coke.Proportion.SetValue(coke.Proportion.Value * TotalProportion.Value * 100);
             tempTotalProportion += coke.Proportion.Value;
         }

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:115:13
         foreach (var coke in cokes)
         {
             coke.Proportion.SetValue(coke.Proportion.Value / TotalProportion.Value * 100);
-            tempTotalProportion += coke.Proportion.Value;
+            tempTotalProportion -= coke.Proportion.Value;
         }
 

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:118:9
             tempTotalProportion += coke.Proportion.Value;
         }
 
-        TotalProportion.SetValue(tempTotalProportion);
+        ;
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:128:5
     /// <param name="pci"></param>
     /// <returns></returns>
     public double CokeRate(HotMetal hotMetal, PulverizedCoalInjection pci)
-    {
-        if (hotMetal == null)
-        {
-            throw new ArgumentNullException(nameof(hotMetal));
-        }
-
-        if (pci == null)
-        {
-            throw new ArgumentNullException(nameof(pci));
-        }
-
-        var blendRequiredWeight = GetBlendRequiredWeight(hotMetal, pci);
-        var blendWeightInKilogram = blendRequiredWeight.GetWeightValue(WeightUnits.kilogram);
-        var hotMetalInMetricTon = hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
-
-        return blendWeightInKilogram / hotMetalInMetricTon;
-    }
+    {}
 
     /// <summary>

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:134:13
             throw new ArgumentNullException(nameof(hotMetal));
         }
 
-        if (pci == null)
+        if (pci != null)
         {
             throw new ArgumentNullException(nameof(pci));

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:135:9
         }
 
         if (pci == null)
-        {
-            throw new ArgumentNullException(nameof(pci));
-        }
+        {}
 
         var blendRequiredWeight = GetBlendRequiredWeight(hotMetal, pci);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:136:13
 
         if (pci == null)
         {
-            throw new ArgumentNullException(nameof(pci));
+            ;
         }
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:143:16
         var blendWeightInKilogram = blendRequiredWeight.GetWeightValue(WeightUnits.kilogram);
         var hotMetalInMetricTon = hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
 
-        return blendWeightInKilogram / hotMetalInMetricTon;
+        return blendWeightInKilogram * hotMetalInMetricTon;
     }
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:162:38
 
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
 
-        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
+        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value * 100;
         var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:162:38
 
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
 
-        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
+        var feWeightInHotMetalInKg = hotMetalWeightinKg / hotMetal.FePercent.Value / 100;
         var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:163:37
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
 
         var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
-        var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
+        var cWeightInHotMetalInKg = hotMetalWeightinKg / hotMetal.CPercent.Value / 100;
 
         // Number of kmols of carbon required to be loaded at blast furnace

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:163:37
         var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
 
         var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
-        var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
+        var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value * 100;
 
         // Number of kmols of carbon required to be loaded at blast furnace

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:166:43
         var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
 
         // Number of kmols of carbon required to be loaded at blast furnace
-        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
+        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) * atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
 
         // Mass of Carbon that must be loaded at blast furnace

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:166:43
         var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
 
         // Number of kmols of carbon required to be loaded at blast furnace
-        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
+        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe - cWeightInHotMetalInKg / atomicWeightCarbon;
 
         // Mass of Carbon that must be loaded at blast furnace

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:169:36
         var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
 
         // Mass of Carbon that must be loaded at blast furnace
-        var carbonWeightRequired = numberOfKmolsCarbonRequired * atomicWeightCarbon;
+        var carbonWeightRequired = numberOfKmolsCarbonRequired / atomicWeightCarbon;
 
         // Coke weight without use of PCI

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:172:68
         var carbonWeightRequired = numberOfKmolsCarbonRequired * atomicWeightCarbon;
 
         // Coke weight without use of PCI
-        var cokeWeightRequiredWithoutPCI = carbonWeightRequired / (AverageCContent.Value / 100);
+        var cokeWeightRequiredWithoutPCI = carbonWeightRequired / (AverageCContent.Value * 100);
 
         // Maximum coke rate

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:172:44
         var carbonWeightRequired = numberOfKmolsCarbonRequired * atomicWeightCarbon;
 
         // Coke weight without use of PCI
-        var cokeWeightRequiredWithoutPCI = carbonWeightRequired / (AverageCContent.Value / 100);
+        var cokeWeightRequiredWithoutPCI = carbonWeightRequired * (AverageCContent.Value / 100);
 
         // Maximum coke rate

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:175:27
         var cokeWeightRequiredWithoutPCI = carbonWeightRequired / (AverageCContent.Value / 100);
 
         // Maximum coke rate
-        var maxCokeRate = cokeWeightRequiredWithoutPCI / hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
+        var maxCokeRate = cokeWeightRequiredWithoutPCI * hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
         return maxCokeRate;
     }

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:218:31
         }
 
         var hotMetalWeightUnitAdjusted = hotMetal.Weight.GetWeightValue(unit);
-        var totalIronWeight = hotMetalWeightUnitAdjusted * hotMetal.FePercent.Value / 100;
+        var totalIronWeight = hotMetalWeightUnitAdjusted / hotMetal.FePercent.Value / 100;
 
         var pciAddedWeightUnitAdjusted = pci.Weight.GetWeightValue(unit);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:218:31
         }
 
         var hotMetalWeightUnitAdjusted = hotMetal.Weight.GetWeightValue(unit);
-        var totalIronWeight = hotMetalWeightUnitAdjusted * hotMetal.FePercent.Value / 100;
+        var totalIronWeight = hotMetalWeightUnitAdjusted * hotMetal.FePercent.Value * 100;
 
         var pciAddedWeightUnitAdjusted = pci.Weight.GetWeightValue(unit);

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:259:9
         }
 
         foreach (var coke in cokes)
-        {
-            var currentCokeWeight = totalWeight.Value * coke.Proportion.Value / currentTotalProportion;
-            coke.SetWeight(currentCokeWeight, unit);
-        }
+        {}
     }
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:260:37
 
         foreach (var coke in cokes)
         {
-            var currentCokeWeight = totalWeight.Value * coke.Proportion.Value / currentTotalProportion;
+            var currentCokeWeight = totalWeight.Value * coke.Proportion.Value * currentTotalProportion;
             coke.SetWeight(currentCokeWeight, unit);
         }

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:260:37
 
         foreach (var coke in cokes)
         {
-            var currentCokeWeight = totalWeight.Value * coke.Proportion.Value / currentTotalProportion;
+            var currentCokeWeight = totalWeight.Value / coke.Proportion.Value / currentTotalProportion;
             coke.SetWeight(currentCokeWeight, unit);
         }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:261:13
         foreach (var coke in cokes)
         {
             var currentCokeWeight = totalWeight.Value * coke.Proportion.Value / currentTotalProportion;
-            coke.SetWeight(currentCokeWeight, unit);
+            ;
         }
     }

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/CokeBlend.cs:270:5
     /// </summary>
     /// <returns></returns>
     public override string ToString()
-    {
-        var jsonRepresentation = JsonConvert.SerializeObject(this, Formatting.Indented);
-
-        return jsonRepresentation.ToString();
-    }
+    {}
 }
 
