[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:35:5
     /// <param name="fePercent"></param>
     /// <param name="cPercent"></param>
     public HotMetal(Weight weight, Percentual fePercent, Percentual cPercent)
-    {
-        if (fePercent.Value + cPercent.Value > 100)
-        {
-            throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");
-        }
-        Weight = weight;
-        FePercent = fePercent;
-        CPercent = cPercent;
-    }
+    {}
 
     /// <summary>

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:36:13
     /// <param name="cPercent"></param>
     public HotMetal(Weight weight, Percentual fePercent, Percentual cPercent)
     {
-        if (fePercent.Value + cPercent.Value > 100)
+        if (fePercent.Value - cPercent.Value > 100)
         {
             throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:36:13
     /// <param name="cPercent"></param>
     public HotMetal(Weight weight, Percentual fePercent, Percentual cPercent)
     {
-        if (fePercent.Value + cPercent.Value > 100)
+        if (fePercent.Value + cPercent.Value >= 100)
         {
             throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:37:9
     public HotMetal(Weight weight, Percentual fePercent, Percentual cPercent)
     {
         if (fePercent.Value + cPercent.Value > 100)
-        {
-            throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");
-        }
+        {}
         Weight = weight;
         FePercent = fePercent;

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:38:108
     {
         if (fePercent.Value + cPercent.Value > 100)
         {
-            throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");
+            throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value - cPercent.Value} %.");
         }
         Weight = weight;

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:38:13
     {
         if (fePercent.Value + cPercent.Value > 100)
         {
-            throw new InvalidOperationException($"Composition should not exceed 100%! Current value is at {fePercent.Value + cPercent.Value} %.");
+            ;
         }
         Weight = weight;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/HotMetal.cs:49:5
     /// String representation of HotMetal
     /// </summary>
     public override string ToString()
-    {
-        // https://code-maze.com/csharp-serialize-enum-to-string/
-        var serializerSettings = new JsonSerializerSettings();
-        serializerSettings.Converters.Add(new StringEnumConverter());
-
-        var jsonRepresentation = JsonConvert.SerializeObject(this, Formatting.Indented, serializerSettings);
-
-        return jsonRepresentation.ToString();
-    }
+    {}
 }
 
