[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOre.cs:27:5
     /// <param name="feContent"></param>
     /// <param name="proportion"></param>
     public IronOre(Percentual feContent, Percentual proportion)
-    {
-        FeContent = feContent;
-        Proportion = proportion;
-        Weight = new Weight(0, WeightUnits.metricTon);
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOre.cs:40:5
     /// <param name="proportion"></param>
     /// <param name="weight"></param>
     public IronOre(Percentual feContent, Percentual proportion, Weight weight)
-    {
-        FeContent = feContent;
-        Proportion = proportion;
-        Weight = weight;
-    }
+    {}
 
     /// <summary>
