[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:24:5
     /// </summary>
     /// <returns></returns>
     public Weight GetBlendRequiredWeight(HotMetal hotmetal)
-    {
-        var hotMetalWeightUnitAdjusted = hotmetal.Weight.GetWeightValue(unit);
-        var totalIronWeight = hotMetalWeightUnitAdjusted * hotmetal.FePercent.Value / 100;
-        var blendRequiredWeight = totalIronWeight / AverageFeContent.Value * 100;
-        var response = new Weight(blendRequiredWeight, unit);
-        return response;
-    }
+    {}
 
     /// <summary>

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:26:31
     public Weight GetBlendRequiredWeight(HotMetal hotmetal)
     {
         var hotMetalWeightUnitAdjusted = hotmetal.Weight.GetWeightValue(unit);
-        var totalIronWeight = hotMetalWeightUnitAdjusted * hotmetal.FePercent.Value / 100;
+        var totalIronWeight = hotMetalWeightUnitAdjusted * hotmetal.FePercent.Value * 100;
         var blendRequiredWeight = totalIronWeight / AverageFeContent.Value * 100;
         var response = new Weight(blendRequiredWeight, unit);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:26:31
     public Weight GetBlendRequiredWeight(HotMetal hotmetal)
     {
         var hotMetalWeightUnitAdjusted = hotmetal.Weight.GetWeightValue(unit);
-        var totalIronWeight = hotMetalWeightUnitAdjusted * hotmetal.FePercent.Value / 100;
+        var totalIronWeight = hotMetalWeightUnitAdjusted / hotmetal.FePercent.Value / 100;
         var blendRequiredWeight = totalIronWeight / AverageFeContent.Value * 100;
         var response = new Weight(blendRequiredWeight, unit);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:27:35
     {
         var hotMetalWeightUnitAdjusted = hotmetal.Weight.GetWeightValue(unit);
         var totalIronWeight = hotMetalWeightUnitAdjusted * hotmetal.FePercent.Value / 100;
-        var blendRequiredWeight = totalIronWeight / AverageFeContent.Value * 100;
+        var blendRequiredWeight = totalIronWeight * AverageFeContent.Value * 100;
         var response = new Weight(blendRequiredWeight, unit);
         return response;

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:27:35
     {
         var hotMetalWeightUnitAdjusted = hotmetal.Weight.GetWeightValue(unit);
         var totalIronWeight = hotMetalWeightUnitAdjusted * hotmetal.FePercent.Value / 100;
-        var blendRequiredWeight = totalIronWeight / AverageFeContent.Value * 100;
+        var blendRequiredWeight = totalIronWeight / AverageFeContent.Value / 100;
         var response = new Weight(blendRequiredWeight, unit);
         return response;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:36:5
     /// Set individual iron ore weights based on calculated required weight
     /// </summary>
     public void SetIronOreWeightsBasedOnRequiredWeight(HotMetal hotmetal)
-    {
-        var totalWeight = GetBlendRequiredWeight(hotmetal);
-
-        var currentTotalProportion = 0.0d;
-        if (TotalProportion.Value == 100)
-        {
-            currentTotalProportion = 100;
-        }
-        else
-        {
-            foreach (var ironOre in ironOres)
-            {
-                currentTotalProportion += ironOre.Proportion.Value;
-            }
-        }
-
-        foreach (var ironOre in ironOres)
-        {
-            var currentIronOreWeight = totalWeight.Value * ironOre.Proportion.Value / currentTotalProportion;
-            ironOre.SetWeight(currentIronOreWeight, unit);
-        }
-    }
+    {}
 
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:45:9
             currentTotalProportion = 100;
         }
         else
-        {
-            foreach (var ironOre in ironOres)
-            {
-                currentTotalProportion += ironOre.Proportion.Value;
-            }
-        }
+        {}
 
         foreach (var ironOre in ironOres)

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:47:13
         else
         {
             foreach (var ironOre in ironOres)
-            {
-                currentTotalProportion += ironOre.Proportion.Value;
-            }
+            {}
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:48:17
         {
             foreach (var ironOre in ironOres)
             {
-                currentTotalProportion += ironOre.Proportion.Value;
+                currentTotalProportion -= ironOre.Proportion.Value;
             }
         }

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:53:9
         }
 
         foreach (var ironOre in ironOres)
-        {
-            var currentIronOreWeight = totalWeight.Value * ironOre.Proportion.Value / currentTotalProportion;
-            ironOre.SetWeight(currentIronOreWeight, unit);
-        }
+        {}
     }
 

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:54:40
 
         foreach (var ironOre in ironOres)
         {
-            var currentIronOreWeight = totalWeight.Value * ironOre.Proportion.Value / currentTotalProportion;
+            var currentIronOreWeight = totalWeight.Value * ironOre.Proportion.Value * currentTotalProportion;
             ironOre.SetWeight(currentIronOreWeight, unit);
         }

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:54:40
 
         foreach (var ironOre in ironOres)
         {
-            var currentIronOreWeight = totalWeight.Value * ironOre.Proportion.Value / currentTotalProportion;
+            var currentIronOreWeight = totalWeight.Value / ironOre.Proportion.Value / currentTotalProportion;
             ironOre.SetWeight(currentIronOreWeight, unit);
         }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:55:13
         foreach (var ironOre in ironOres)
         {
             var currentIronOreWeight = totalWeight.Value * ironOre.Proportion.Value / currentTotalProportion;
-            ironOre.SetWeight(currentIronOreWeight, unit);
+            ;
         }
     }

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:64:5
     /// Initialization of iron ore blend
     /// </summary>
     public IronOreBlend()
-    {
-        ironOres = new List<IronOre>();
-        TotalProportion = new Percentual(0);
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:75:9
     public ReadOnlyCollection<IronOre> IronOres
     {
         get
-        {
-            return ironOres.AsReadOnly();
-        }
+        {}
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:95:9
     public Percentual AverageFeContent
     {
         get
-        {
-            var currentTotalProportion = 0.0d;
-            if (TotalProportion.Value == 100)
-            {
-                currentTotalProportion = 100;
-            }
-            else
-            {
-                foreach (var ironOre in ironOres)
-                {
-                    currentTotalProportion += ironOre.Proportion.Value;
-                }
-            }
-
-            var averageFeContentValue = 0.0d;
-
-            foreach (var ironOre in ironOres)
-            {
-                averageFeContentValue += ironOre.FeContent.Value * ironOre.Proportion.Value / currentTotalProportion;
-            }
-
-            var averageFeContent = new Percentual(averageFeContentValue);
-
-            return averageFeContent;
-        }
+        {}
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:112:13
             var averageFeContentValue = 0.0d;
 
             foreach (var ironOre in ironOres)
-            {
-                averageFeContentValue += ironOre.FeContent.Value * ironOre.Proportion.Value / currentTotalProportion;
-            }
+            {}
 
             var averageFeContent = new Percentual(averageFeContentValue);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:113:42
 
             foreach (var ironOre in ironOres)
             {
-                averageFeContentValue += ironOre.FeContent.Value * ironOre.Proportion.Value / currentTotalProportion;
+                averageFeContentValue += ironOre.FeContent.Value * ironOre.Proportion.Value * currentTotalProportion;
             }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:113:17
 
             foreach (var ironOre in ironOres)
             {
-                averageFeContentValue += ironOre.FeContent.Value * ironOre.Proportion.Value / currentTotalProportion;
+                averageFeContentValue -= ironOre.FeContent.Value * ironOre.Proportion.Value / currentTotalProportion;
             }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:128:5
     /// <param name="ironOre"></param>
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(IronOre ironOre)
-    {
-        if (TotalProportion.Value + ironOre.Proportion.Value > 100)
-        {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");
-        }
-
-        if (ironOres.Count == 0)
-        {
-            unit = ironOre.Weight.Unit;
-        }
-
-        var convertedWeight = ironOre.Weight.GetWeightValue(unit);
-        var newWeight = new Weight(convertedWeight, unit);
-        var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
-
-        TotalProportion.SetValue(TotalProportion.Value + ironOreToAdd.Proportion.Value);
-        ironOres.Add(ironOreToAdd);
-    }
+    {}
 
     /// <summary>

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:129:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(IronOre ironOre)
     {
-        if (TotalProportion.Value + ironOre.Proportion.Value > 100)
+        if (TotalProportion.Value + ironOre.Proportion.Value < 100)
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");

[Killed] Negate expression
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:129:13
     /// <exception cref="InvalidOperationException"></exception>
     public void Add(IronOre ironOre)
     {
-        if (TotalProportion.Value + ironOre.Proportion.Value > 100)
+        if (!(TotalProportion.Value + ironOre.Proportion.Value > 100))
         {
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:130:9
     public void Add(IronOre ironOre)
     {
         if (TotalProportion.Value + ironOre.Proportion.Value > 100)
-        {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");
-        }
+        {}
 
         if (ironOres.Count == 0)

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:131:13
     {
         if (TotalProportion.Value + ironOre.Proportion.Value > 100)
         {
-            throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");
+            ;
         }
 

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:134:13
             throw new InvalidOperationException("Total proportion must be at a maximum of 100%. Iron ore passed as parameter was not added to the blend.");
         }
 
-        if (ironOres.Count == 0)
+        if (ironOres.Count != 0)
         {
             unit = ironOre.Weight.Unit;

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:135:9
         }
 
         if (ironOres.Count == 0)
-        {
-            unit = ironOre.Weight.Unit;
-        }
+        {}
 
         var convertedWeight = ironOre.Weight.GetWeightValue(unit);

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:143:9
         var newWeight = new Weight(convertedWeight, unit);
         var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
 
-        TotalProportion.SetValue(TotalProportion.Value + ironOreToAdd.Proportion.Value);
+        ;
         ironOres.Add(ironOreToAdd);
     }

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:143:34
         var newWeight = new Weight(convertedWeight, unit);
         var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
 
-        TotalProportion.SetValue(TotalProportion.Value + ironOreToAdd.Proportion.Value);
+        TotalProportion.SetValue(TotalProportion.Value - ironOreToAdd.Proportion.Value);
         ironOres.Add(ironOreToAdd);
     }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:144:9
         var ironOreToAdd = new IronOre(ironOre.FeContent, ironOre.Proportion, newWeight);
 
         TotalProportion.SetValue(TotalProportion.Value + ironOreToAdd.Proportion.Value);
-        ironOres.Add(ironOreToAdd);
+        ;
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:151:5
     /// Normalize proportions of iron ores to 100%
     /// </summary>
     public void NormalizeProportions()
-    {
-        var tempTotalProportion = 0d;
-
-        foreach (var ironOre in ironOres)
-        {
-            ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value * 100);
-            tempTotalProportion += ironOre.Proportion.Value;
-        }
-
-        TotalProportion.SetValue(tempTotalProportion);
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:155:9
         var tempTotalProportion = 0d;
 
         foreach (var ironOre in ironOres)
-        {
-            ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value * 100);
-            tempTotalProportion += ironOre.Proportion.Value;
-        }
+        {}
 
         TotalProportion.SetValue(tempTotalProportion);

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:156:41
 
         foreach (var ironOre in ironOres)
         {
-            ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value * 100);
+            ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value / 100);
             tempTotalProportion += ironOre.Proportion.Value;
         }

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:156:41
 
         foreach (var ironOre in ironOres)
         {
-            ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value * 100);
+            ironOre.Proportion.SetValue(ironOre.Proportion.Value * TotalProportion.Value * 100);
             tempTotalProportion += ironOre.Proportion.Value;
         }

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
csharp/src/BlastFurnace.MassBalance.Lib/IronOreBlend.cs:157:13
         foreach (var ironOre in ironOres)
         {
             ironOre.Proportion.SetValue(ironOre.Proportion.Value / TotalProportion.Value * 100);
-            tempTotalProportion += ironOre.Proportion.Value;
+            tempTotalProportion -= ironOre.Proportion.Value;
         }
 
