[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:22:5
     /// </summary>
     /// <param name="value"></param>
     public Percentual(double value)
-    {
-        SetValue(value);
-    }
+    {}
 
     /// <summary>

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:23:9
     /// <param name="value"></param>
     public Percentual(double value)
     {
-        SetValue(value);
+        ;
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:31:5
     /// </summary>
     /// <param name="value"></param>
     public void SetValue(double value)
-    {
-        if (value < 0 || value > 100)
-        {
-            throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");
-        }
-        Value = value;
-    }
+    {}
 
     /// <summary>

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:32:13
     /// <param name="value"></param>
     public void SetValue(double value)
     {
-        if (value < 0 || value > 100)
+        if (value <= 0 || value > 100)
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:32:26
     /// <param name="value"></param>
     public void SetValue(double value)
     {
-        if (value < 0 || value > 100)
+        if (value < 0 || value >= 100)
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:33:9
     public void SetValue(double value)
     {
         if (value < 0 || value > 100)
-        {
-            throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");
-        }
+        {}
         Value = value;
     }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/Percentual.cs:34:13
     {
         if (value < 0 || value > 100)
         {
-            throw new ArgumentOutOfRangeException(nameof(value), $"Percentage value must belong to [0,100] interval. Current value ({value}) is invalid!");
+            ;
         }
         Value = value;
