[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:30:5
     /// <param name="cContent"></param>
     /// <param name="weight"></param>
     public PulverizedCoalInjection(Percentual cContent, Weight weight)
-    {
-        CContent = cContent;
-        SetWeight(weight);
-    }
+    {}
 
     /// <summary>

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:32:9
     public PulverizedCoalInjection(Percentual cContent, Weight weight)
     {
         CContent = cContent;
-        SetWeight(weight);
+        ;
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:40:5
     /// </summary>
     /// <param name="cContent"></param>
     public PulverizedCoalInjection(Percentual cContent)
-    {
-        CContent = cContent;
-        var weight = new Weight(0, WeightUnits.metricTon);
-        SetWeight(weight);
-    }
+    {}
 #pragma warning restore CS8618 // Non-nullable field must contain a non-null value when exiting constructor. Consider declaring as nullable.
 

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:43:9
     {
         CContent = cContent;
         var weight = new Weight(0, WeightUnits.metricTon);
-        SetWeight(weight);
+        ;
     }
 #pragma warning restore CS8618 // Non-nullable field must contain a non-null value when exiting constructor. Consider declaring as nullable.

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:53:5
     /// <param name="weight"></param>
     /// <exception cref="InvalidOperationException"></exception>
     public void SetWeight(Weight weight)
-    {
-        if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
-        {
-            throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");
-        }
-        this.Weight = new Weight(weight.Value, weight.Unit);
-    }
+    {}
 
     private Weight maximumPCIWeight = new Weight(double.MaxValue, WeightUnits.metricTon);

[Killed] Negate expression
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:54:13
     /// <exception cref="InvalidOperationException"></exception>
     public void SetWeight(Weight weight)
     {
-        if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
+        if (!(weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon)))
         {
             throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:54:13
     /// <exception cref="InvalidOperationException"></exception>
     public void SetWeight(Weight weight)
     {
-        if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
+        if (weight.GetWeightValue(WeightUnits.metricTon) < maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
         {
             throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:55:9
     public void SetWeight(Weight weight)
     {
         if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
-        {
-            throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");
-        }
+        {}
         this.Weight = new Weight(weight.Value, weight.Unit);
     }

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:56:13
     {
         if (weight.GetWeightValue(WeightUnits.metricTon) > maximumPCIWeight.GetWeightValue(WeightUnits.metricTon))
         {
-            throw new InvalidOperationException($"It is not possible to set weight of PCI higher than {maximumPCIWeight.GetWeightValue(WeightUnits.metricTon):F0} metric tons.");
+            ;
         }
         this.Weight = new Weight(weight.Value, weight.Unit);

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:69:5
     /// <param name="hotMetal"></param>
     /// <returns></returns>
     public double PCIRate(HotMetal hotMetal)
-    {
-        if (hotMetal == null)
-        {
-            throw new ArgumentNullException(nameof(hotMetal));
-        }
-
-        var pciWeightInKilogram = Weight.GetWeightValue(WeightUnits.kilogram);
-        var hotMetalInMetricTon = hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
-
-        return pciWeightInKilogram / hotMetalInMetricTon;
-    }
+    {}
 
     /// <summary>

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:78:16
         var pciWeightInKilogram = Weight.GetWeightValue(WeightUnits.kilogram);
         var hotMetalInMetricTon = hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
 
-        return pciWeightInKilogram / hotMetalInMetricTon;
+        return pciWeightInKilogram * hotMetalInMetricTon;
     }
 

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:86:5
     /// </summary>
     /// <returns></returns>
     public double MaximumPCIRate(HotMetal hotMetal)
-    {
-        if (hotMetal == null)
-        {
-            throw new ArgumentNullException(nameof(hotMetal));
-        }
-
-        var hotMetalWeightinKg = hotMetal.Weight.GetWeightValue(WeightUnits.kilogram);
-        var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
-
-        // Mass of burned carbon (in kilograms)
-        var PCqu = (0.02 * feWeightInHotMetalInKg) * (12);
-
-        // Maximum weight of PCI allowed (also in kilograms)
-        var PCI = PCqu / (CContent.Value / 100);
-
-        // Maximum PCI rate in kilograms of PCI per metric ton of hot metal
-        var PCIratmx = PCI / hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
-
-        var PCIMaxWeightInMetricTon = PCI / 1000;
-
-        maximumPCIWeight = new Weight(PCIMaxWeightInMetricTon, WeightUnits.metricTon);
-
-        return PCIratmx;
-    }
+    {}
 
     /// <summary>

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:96:21
         var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
 
         // Mass of burned carbon (in kilograms)
-        var PCqu = (0.02 * feWeightInHotMetalInKg) * (12);
+        var PCqu = (0.02 / feWeightInHotMetalInKg) * (12);
 
         // Maximum weight of PCI allowed (also in kilograms)

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:96:20
         var feWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.FePercent.Value / 100;
 
         // Mass of burned carbon (in kilograms)
-        var PCqu = (0.02 * feWeightInHotMetalInKg) * (12);
+        var PCqu = (0.02 * feWeightInHotMetalInKg) / (12);
 
         // Maximum weight of PCI allowed (also in kilograms)

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:99:19
         var PCqu = (0.02 * feWeightInHotMetalInKg) * (12);
 
         // Maximum weight of PCI allowed (also in kilograms)
-        var PCI = PCqu / (CContent.Value / 100);
+        var PCI = PCqu * (CContent.Value / 100);
 
         // Maximum PCI rate in kilograms of PCI per metric ton of hot metal

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:99:27
         var PCqu = (0.02 * feWeightInHotMetalInKg) * (12);
 
         // Maximum weight of PCI allowed (also in kilograms)
-        var PCI = PCqu / (CContent.Value / 100);
+        var PCI = PCqu / (CContent.Value * 100);
 
         // Maximum PCI rate in kilograms of PCI per metric ton of hot metal

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:102:24
         var PCI = PCqu / (CContent.Value / 100);
 
         // Maximum PCI rate in kilograms of PCI per metric ton of hot metal
-        var PCIratmx = PCI / hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
+        var PCIratmx = PCI * hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
 
         var PCIMaxWeightInMetricTon = PCI / 1000;

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/PulverizedCoalInjection.cs:104:39
         // Maximum PCI rate in kilograms of PCI per metric ton of hot metal
         var PCIratmx = PCI / hotMetal.Weight.GetWeightValue(WeightUnits.metricTon);
 
-        var PCIMaxWeightInMetricTon = PCI / 1000;
+        var PCIMaxWeightInMetricTon = PCI * 1000;
 
         maximumPCIWeight = new Weight(PCIMaxWeightInMetricTon, WeightUnits.metricTon);
