[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/UnitConversion.cs:34:42
                         convertedValue = originalWeight.Value;
                         break;
                     case WeightUnits.metricTon:
-                        convertedValue = originalWeight.Value / metricTonTokgFactor;
+                        convertedValue = originalWeight.Value * metricTonTokgFactor;
                         break;
                     default:

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/UnitConversion.cs:45:42
                 switch (newWeightUnits)
                 {
                     case WeightUnits.kilogram:
-                        convertedValue = originalWeight.Value * metricTonTokgFactor;
+                        convertedValue = originalWeight.Value / metricTonTokgFactor;
                         break;
                     case WeightUnits.metricTon:

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/UnitConversion.cs:85:42
                         convertedValue = originalVolume.Value;
                         break;
                     case VolumeUnits.Nm3:
-                        convertedValue = originalVolume.Value / standardCubicMeterToLiterFactor;
+                        convertedValue = originalVolume.Value * standardCubicMeterToLiterFactor;
                         break;
                     default:

[Killed] Arithmetic mutation
csharp/src/BlastFurnace.MassBalance.Lib/UnitConversion.cs:96:42
                 switch (newVolumeUnits)
                 {
                     case VolumeUnits.NL:
-                        convertedValue = originalVolume.Value * standardCubicMeterToLiterFactor;
+                        convertedValue = originalVolume.Value / standardCubicMeterToLiterFactor;
                         break;
                     case VolumeUnits.Nm3:
