[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:29:5
     /// <param name="outputUnit"></param>
     /// <returns></returns>
     public double GetVolumeValue(VolumeUnits outputUnit)
-    {
-        return UnitConversion.VolumeConversion(this,outputUnit).Value;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:40:5
     /// <param name="units"></param>
     /// <exception cref="ArgumentOutOfRangeException"></exception>
     public Volume(double value, VolumeUnits units)
-    {
-        if (value < 0 )
-        {
-            throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");
-        }
-
-        Value = value;
-        Unit = units;
-    }
+    {}
 
     /// <summary>

[Killed] Negate expression
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:41:13
     /// <exception cref="ArgumentOutOfRangeException"></exception>
     public Volume(double value, VolumeUnits units)
     {
-        if (value < 0 )
+        if (!(value < 0 ) )
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:41:13
     /// <exception cref="ArgumentOutOfRangeException"></exception>
     public Volume(double value, VolumeUnits units)
     {
-        if (value < 0 )
+        if (value <= 0 )
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:42:9
     public Volume(double value, VolumeUnits units)
     {
         if (value < 0 )
-        {
-            throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");
-        }
+        {}
 
         Value = value;

[Killed] Statement mutation
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:43:13
     {
         if (value < 0 )
         {
-            throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");
+            ;
         }
 

[Killed] String mutation
csharp/src/BlastFurnace.MassBalance.Lib/Volume.cs:43:66
     {
         if (value < 0 )
         {
-            throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");
+            throw new ArgumentOutOfRangeException(nameof(value), $"");
         }
 
