[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Weight.cs:29:5
     /// <param name="outputUnit"></param>
     /// <returns></returns>
     public double GetWeightValue(WeightUnits outputUnit)
-    {
-        return UnitConversion.WeightConversion(this,outputUnit).Value;
-    }
+    {}
 
     /// <summary>

[Killed] Block removal mutation
csharp/src/BlastFurnace.MassBalance.Lib/Weight.cs:40:5
     /// <param name="units"></param>
     /// <exception cref="ArgumentOutOfRangeException"></exception>
     public Weight(double value, WeightUnits units)
-    {
-        if (value < 0 )
-        {
-            throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");
-        }
-
-        Value = value;
-        Unit = units;
-    }
+    {}
 
     /// <summary>

[Killed] Equality mutation
csharp/src/BlastFurnace.MassBalance.Lib/Weight.cs:41:13
     /// <exception cref="ArgumentOutOfRangeException"></exception>
     public Weight(double value, WeightUnits units)
     {
-        if (value < 0 )
+        if (value > 0 )
         {
             throw new ArgumentOutOfRangeException(nameof(value), $"{nameof(value)} can't be negative!");
