[Killed] Arithmetic mutation
src/csharp/BlastFurnace.MassBalance.Lib/CokeBlend.cs:130:44
         var cWeightInHotMetalInKg = hotMetalWeightinKg * hotMetal.CPercent.Value / 100;
 
         // Number of kmols of carbon required to be loaded at blast furnace
-        var numberOfKmolsCarbonRequired = (2.12 * feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
+        var numberOfKmolsCarbonRequired = (2.12 / feWeightInHotMetalInKg) / atomicWeightFe + cWeightInHotMetalInKg / atomicWeightCarbon;
 
         // Mass of Carbon that must be loaded at blast furnace
